sedan/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    maxY
    {
        type            patch;
        nFaces          3600;
        startFace       1456385;
    }
    minX
    {
        type            patch;
        nFaces          5400;
        startFace       1459985;
    }
    maxX
    {
        type            patch;
        nFaces          5400;
        startFace       1465385;
    }
    minY
    {
        type            patch;
        nFaces          3600;
        startFace       1470785;
    }
    minZ
    {
        type            patch;
        nFaces          5400;
        startFace       1474385;
    }
    maxZ
    {
        type            patch;
        nFaces          5400;
        startFace       1479785;
    }
    sedan
    {
        type            wall;
        inGroups        1(wall);
        nFaces          31812;
        startFace       1485185;
    }
)

// ************************************************************************* //
