sedan/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8; //was 6

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions            // Start listing function objects here
{
    wallShearStress  // user-defined name of function object entry
    {
        type        wallShearStress;  //the official name of the utility 
        functionObjectLibs ("libutilityFunctionObjects.so");  //where the utility c++ code is
         patches     ("visc_main"      
	 	      "visc_refine_1"  
              	      "visc_refine_2");   
    }	
}


// ************************************************************************* //
